Revit 2026 API

# PointCloudColorSettings(PointCloudColorSettings) Constructor

---

Constructs a copy of source object.

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PointCloudColorSettings(
	PointCloudColorSettings other
)
```
```vb
Public Sub New (
	other As PointCloudColorSettings
)
```
```cpp
public:
PointCloudColorSettings(
	PointCloudColorSettings^ other
)
```
```fsharp
new :
        other : PointCloudColorSettings -> PointCloudColorSettings
```

#### Parameters

other PointCloudColorSettings
     Source object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PointCloudColorSettings Class

PointCloudColorSettings Overload

Autodesk.Revit.DB.PointClouds Namespace